#!/usr/bin/env python3
# -*- coding: utf-8 -*-
"""
Created on Wed Nov 11 09:34:16 2020

@author: rodger_chen
"""

import json
import io
import re


def clearWord(word):
    
    r1 = '[a-zA-Z0-9’!"#$%&\'()*+,-./:;<=>?@，。?★、…【】《》？“”‘’！[\\]^_`{|}~]+'
    # word = word.replace('-','')
    # word = word.replace('，','')
    # word = word.replace('。','')
    word = word.replace('；','')
    word = word.replace('·','')
    word = word.replace('：','')
    word = word.replace('（','')
    word = word.replace('）','')
    word = word.replace('「','')
    word = word.replace('」','')
    word = word.replace(' ','')
    return re.sub(r1, '', word)

data = {}
path = '../data/data_Content_1.txt'
with open(path, encoding="utf-8") as jsonFile:        
    data = json.load(jsonFile)

content = '是中國道教及中國神話中的八位神仙分別代表男女老幼貧賤富貴八種不同的人羣由於均為凡人得道\
所以個性與百姓較為接近晚近為道教中相當重要的神仙代表中國許多地方都有宮迎神賽會也都少不了他們手持\
的法器或寶物也稱為八寶的由來一詞在中國歷史上的不同時期一直擁有不同的涵義直到明朝吳元泰的出處東遊記\
一般稱為東遊記才正式定型為鐵拐李漢鍾離或鍾離權呂洞賓張果老何仙姑曹國舅韓湘子及藍采和道教的緣起於\
唐宋時期當時民間已有圖在元朝馬致遠的嶽陽樓範子安的竹葉船和穀子敬的城南柳等雜劇中都有的蹤跡但是成員\
經常變動馬致遠的呂洞賓三醉嶽陽樓中並沒有何仙姑取而代之的是徐神翁在嶽伯川呂洞賓度鐵拐李嶽中有張四郎\
卻沒有何仙姑明三寶太監西洋記演義中的則以風僧壽玄虛子取代張果老何仙姑劉海或作劉海蟾雖然現在不列在當中\
但在許多地區仍位於之列明列仙全傳用劉海頂替了張果老在江西某些地區的跳中也有以劉海代替漢鍾離的而臺灣亦\
有用劉海替代藍采和南宋末年的李簡易玉溪子丹經指要卷首載混元仙派圖列舉了內丹鍾呂一系的傳承系譜雖不可盡信\
卻不失爲最早最系統的內丹傳承史料按該圖所列第一代鍾離權所傳有呂洞賓王老真人陳樸等其中呂洞賓最爲著名據史\
料鍾呂二人活動於唐末至北宋初在五代末已頗有名第三代以呂洞賓所傳最多計有曹國舅陳七子\
劉海蟾景知常姚道真趙仙姑麻衣道者郭上竈何昌一老木仙翁李鐵柺施肩吾張侍郎徐神翁劉高上浪然子沈東老\
張和尚王喆浴室和尚川張迪功掛須玉溪叟等其中鍾離權呂洞賓曹國舅李鐵柺這四位道教人物都是後世原型而\
劉海蟾張四郎或作張侍郎徐神翁也曾一度在的隊伍中出現過日本民間信仰也有類似的神明組合稱為七福神七福神中\
除了惠比須為日本固有神明之外其餘皆為外來神明大黑天毘沙門天辯財天傳自印度佛教壽老人福祿壽布袋則\
傳自中國由於中日兩地文化影響加上七福神搭寶船的形象與過海類似也有學者認為七福神是由中國而來形象與道教\
許多神仙不同均來自人間而且都有多采多姿的凡間故事之後才得道與一般神仙道貌岸然的形象截然不同所以深受民眾\
喜愛其中有將軍皇親國戚乞丐道士等等並非生而為仙而且都有些缺點例如漢鍾離袒胸露乳呂洞賓個性輕佻鐵拐李\
酗酒成性等等但他們都是道家的仙人常常在一起也分別代表了男女老幼富貴貧賤也因此一般道教宮觀都有供奉的地方\
或是獨立設置宮而神明廟會也有出現也常出現在年畫刺繡瓷器花燈及戲劇之中相傳也會定期赴西王母蟠桃會祝壽\
所以祝壽也成為民間藝術常見的的祝壽題材民間戲曲酬神時也經常上演醉或祝壽等所謂扮仙戲豐富了中國神話文化\
增添了神話的神祕性暗每人都有一至二樣寶物或法器一般稱為暗或八寶常出現於刺繡民間藝術之中均代表吉祥之意\
而且隨場景不同而變換其中較為通俗的暗為過海過海是最膾炙人口的故事之一最早見於雜劇爭玉板過海中相傳\
白雲仙長有回於蓬萊仙島牡丹盛開時邀請及五聖共襄盛舉回程時鐵拐李或呂洞賓建議不搭船而各自想辦法就是後來\
過海各顯神通或過海各憑本事的起源此時李鐵拐拋下自己另一項法器鐵拐或說葫蘆漢鍾離扔了芭蕉扇張果老放下坐騎\
紙驢其他神仙也各擲法器下水橫渡東海由於的舉動驚動龍宮東海龍王率領蝦兵蟹將前往理論不料發生衝突藍采和被帶回\
龍宮亦說法器被搶之後大開殺戒怒斬龍子而東海龍王會同四海龍王兄弟合作一時之間驚濤駭浪此時曹國舅拿出玉板\
開路將巨浪逼往兩旁順利渡海最後由南海觀音菩薩或說如來佛出面調停要求東海龍王釋放藍采和之後雙方纔停戰\
蜀之即容成公李耳董仲舒張道陵莊君平李八百範長生爾朱先生等八人道教傳說他們均在蜀中得道成仙譙秀的蜀記\
一書中稱他們爲蜀之'

# idx = 876235
keyword = '八仙'
# del data[keyword]
content = clearWord(content)
print(content)
# data[keyword] = {
#     'c':content
#     }
data[keyword]['c'] = content


with open(path, 'w', encoding='utf-8') as outfile:
    json.dump(data, outfile, ensure_ascii=False)



pathTitle = '../data/idxMapping.txt'
titleData={}
with open(pathTitle, encoding="utf-8") as jsonFile:
    titleData = json.load(jsonFile)

# del titleData[keyword]
# titleData[keyword] = idx

# with open(pathTitle, 'w', encoding='utf-8') as outfile:
#     json.dump(titleData, outfile, ensure_ascii=False)

        